eiefirmware/eiefw3/SAM3U2/firmware_common/bsp/configuration.h
/*!*********************************************************************************************************************
@file configuration.h      
@brief Main configuration header file for project.  

This file bridges many of the generic features of the 
firmware to the specific features of the design. The definitions should be updated
to match the target hardware.  
 
Bookmarks:

!!!!! External module peripheral assignments

@@@@@ GPIO board-specific parameters

##### Communication peripheral board-specific parameters


Quick references:

DEBUG UART IS 115200-8-N-1

ANT BOARDTEST CHANNEL CONFIG: 
ID: 4660 (0x1234) 
Device Type: 96(0x60)  
Transmission Type: 1

***********************************************************************************************************************/

#ifndef __CONFIG_H
#define __CONFIG_H

/**********************************************************************************************************************
Runtime switches
***********************************************************************************************************************/
//#define MPGL2_R01                   /*!< Use with MPGL2-EHDW-01 revision board */

#define DEBUG_MODE                /*!< Define to enable certain debugging code */
//#define STARTUP_SOUND              /*!< Define to include buzzer sound on startup */

//#define USE_SIMPLE_USART0   /*!< Define to use USART0 as a very simple byte-wise UART for debug purposes */


/**********************************************************************************************************************
Type Definitions
**********************************************************************************************************************/
/*! 
@enum PeripheralType
@brief Short names used to identify peripherals in their configuration structs.

This provides self-documentation when indexing peripherals and when assigning
better names for devices that make use of the peripherals.
*/
typedef enum {SPI, UART, USART0, USART1, USART2, USART3} PeripheralType;


/**********************************************************************************************************************
Includes
***********************************************************************************************************************/
/* Common header files */
#include <stdlib.h>
#include <string.h>
#include "AT91SAM3U4.h"
#include "exceptions.h"
#include "interrupts.h"
#include "core_cm3.h"
#include "main.h"
#include "typedefs.h"
#include "utilities.h"

/* Common driver header files */
#include "buttons.h"
#include "leds.h" 
#include "messaging.h"
#include "timer.h" 

#include "sam3u_i2c.h"
#include "sam3u_ssp.h"
#include "sam3u_uart.h"
#include "adc12.h"

/* EIEF1-PCB-01 specific header files */
#ifdef EIE1
#include "eief1-pcb-01.h"
#include "lcd_nhd-c0220biz.h"
#include "sdcard.h"
#endif /* EIE1 */

/* Common application header files */
#include "debug.h"
#include "music.h"
#include "nrf_interface.h"
#include "user_app1.h"
#include "user_app2.h"
#include "user_app3.h"



/**********************************************************************************************************************
!!!!! External device peripheral assignments
***********************************************************************************************************************/
/* Peripheral assignments */
#define BLADE_UART                  UART
#define DEBUG_UART                  USART0
#define BLADE_SPI                   SPI
#define NRF_SPI                     USART2

#ifdef EIE1
#define SD_SSP                      USART1
#endif

#ifdef MPGL2
#define LCD_SPI                     USART1
#endif

/*! @cond DOXYGEN_EXCLUDE */
/* %UART% Configuration */
/* Blade UART Peripheral Allocation (UART) */
#define UART_US_CR_INIT             BLADE_US_CR_INIT
#define UART_US_MR_INIT             BLADE_US_MR_INIT
#define UART_US_IER_INIT            BLADE_US_IER_INIT
#define UART_US_IDR_INIT            BLADE_US_IDR_INIT
#define UART_US_BRGR_INIT           BLADE_US_BRGR_INIT

#define UART_IRQHandler             DBGU_IrqHandler
#define BLADE_UART_PERIPHERAL       AT91C_ID_DBGU


/* Debug UART Peripheral Allocation (USART0) */
#define USART0_US_CR_INIT           DEBUG_US_CR_INIT
#define USART0_US_MR_INIT           DEBUG_US_MR_INIT
#define USART0_US_IER_INIT          DEBUG_US_IER_INIT
#define USART0_US_IDR_INIT          DEBUG_US_IDR_INIT
#define USART0_US_BRGR_INIT         DEBUG_US_BRGR_INIT

#define UART0_IRQHandler            USART0_IrqHandler
#define DEBUG_UART_PERIPHERAL       AT91C_ID_US0

#if 0
/* %SPI% Blade SPI Peripheral Allocation */
#define SD_BASE_PORT                AT91C_BASE_PIOA
#define SD_CS_PIN                   PA_08_SD_CS_MCDA3
#define USART1_US_CR_INIT           SD_US_CR_INIT
#define USART1_US_MR_INIT           SD_US_MR_INIT
#define USART1_US_IER_INIT          SD_US_IER_INIT
#define USART1_US_IDR_INIT          SD_US_IDR_INIT
#define USART1_US_BRGR_INIT         SD_US_BRGR_INIT

#define SPI_IRQHandler              SPI_IrqHandler
#endif

#ifdef EIE1
/* %SSP% Configuration */
/* SD SPI Peripheral Allocation (USART1) */
#define SD_BASE_PORT                AT91C_BASE_PIOA
#define SD_CS_PIN                   PA_08_SD_CS_MCDA3
#define USART1_US_CR_INIT           SD_US_CR_INIT
#define USART1_US_MR_INIT           SD_US_MR_INIT
#define USART1_US_IER_INIT          SD_US_IER_INIT
#define USART1_US_IDR_INIT          SD_US_IDR_INIT
#define USART1_US_BRGR_INIT         SD_US_BRGR_INIT

#define SSP1_IRQHandler             USART1_IrqHandler
#endif /* EIE1 */


#ifdef MPGL2
/* %SSP% Configuration */
/* LCD SPI Peripheral Allocation (USART1) */
#define LCD_SPI                     USART1
#define LCD_BASE_PORT               AT91C_BASE_PIOB
#define LCD_CS_PIN                  PB_12_LCD_CS
#define USART1_US_CR_INIT           LCD_US_CR_INIT
#define USART1_US_MR_INIT           LCD_US_MR_INIT
#define USART1_US_IER_INIT          LCD_US_IER_INIT
#define USART1_US_IDR_INIT          LCD_US_IDR_INIT
#define USART1_US_BRGR_INIT         LCD_US_BRGR_INIT

#define SSP1_IRQHandler             USART1_IrqHandler
#endif /* MPGL2 */

/* nRF51422 SPI Peripheral Allocation (USART2) */
#define USART2_US_CR_INIT           NRF_US_CR_INIT
#define USART2_US_MR_INIT           NRF_US_MR_INIT
#define USART2_US_IER_INIT          NRF_US_IER_INIT
#define USART2_US_IDR_INIT          NRF_US_IDR_INIT
#define USART2_US_BRGR_INIT         NRF_US_BRGR_INIT

