eiefirmware/eiefw3/SAM3U2/firmware_common/bsp/configuration.h
#define SSP2_IRQHandler             USART2_IrqHandler

#define NRF_SPI_CS_GPIO             AT91C_BASE_PIOB
#define NRF_SPI_CS_PIN              PB_22_ANT_USPI2_CS

/*! @endcond */


/***********************************************************************************************************************
@@@@@ GPIO board-specific parameters
***********************************************************************************************************************/
/*----------------------------------------------------------------------------------------------------------------------
%LED% LED Configuration                                                                                                  
------------------------------------------------------------------------------------------------------------------------
Update the values below for the LEDs on the board.  Any name can be used for the LED definitions.
Open the LED source.c and edit Led_au32BitPositions and Leds_asLedArray with the correct values for the LEDs in the system.  
*/

#ifdef EIE1
#define TOTAL_LEDS            (u8)11        /*!< Total number of LEDs in the system */
#endif /* EIE1 */


#ifdef MPGL2

#ifdef MPGL2_R01
#define TOTAL_LEDS            (u8)5         /*!< Total number of LEDs in the system */
#else
#define TOTAL_LEDS            (u8)13        /*!< Total number of LEDs in the system */
#endif /* MPGL2_R01 */

#endif /* MPGL2 */


/*----------------------------------------------------------------------------------------------------------------------
%BUTTON% Button Configuration                                                                                                  
------------------------------------------------------------------------------------------------------------------------
Update the values below for the buttons on the board.  Any name can be used for the BUTTON definitions.
Open buttons.c and edit the GPIO definitions sections with the bit numbers for the buttons.
The order of the definitions below must match the order of the definitions provided in buttons.c. 
*/

#ifdef EIE1
#define TOTAL_BUTTONS         (u8)4       /*!< Total number of Buttons in the system */

#define BUTTON0               (u32)0
#define BUTTON1               (u32)1
#define BUTTON2               (u32)2
#define BUTTON3               (u32)3

/*! All buttons on each port must be ORed together here: set to 0 if no buttons on the port */
#define GPIOA_BUTTONS         (u32)( PA_17_BUTTON0 )
#define GPIOB_BUTTONS         (u32)( PB_00_BUTTON1 | PB_01_BUTTON2 | PB_02_BUTTON3 )
#endif /* EIE1 */

#ifdef MPGL2
#define TOTAL_BUTTONS         (u8)2       /*!< Total number of Buttons in the system */

#define BUTTON0               (u32)0
#define BUTTON1               (u32)1

/*! All buttons on each port must be ORed together here: set to 0 if no buttons on the port */
#define GPIOA_BUTTONS         (u32)( PA_17_BUTTON0 )
#define GPIOB_BUTTONS         (u32)( PB_00_BUTTON1 )
#endif /* MPGL2 */

#endif /* __CONFIG_H */


/*----------------------------------------------------------------------------------------------------------------------
%BUZZER% Buzzer Configuration                                                                                                  
------------------------------------------------------------------------------------------------------------------------
EIE1 has two buzzers, MPG2 only has one */

#define BUZZER1               AT91C_PWMC_CHID0

#ifdef EIE1
#define BUZZER2               AT91C_PWMC_CHID1
#endif /* EIE1 */


/*----------------------------------------------------------------------------------------------------------------------
%ADC% Analog input channel Configuration                                                                                                  
------------------------------------------------------------------------------------------------------------------------
Available analog channels are defined here.  The names in the arrays come from
the board-specific definition header file in section !!!!! GPIO pin names
*/
#ifdef EIE1
#define   ADC_CHANNEL_ARRAY   {ADC12_POTENTIOMETER, ADC12_BLADE_AN0, ADC12_BLADE_AN1}
#endif /* EIE1 */

#ifdef MPGL2
#define   ADC_CHANNEL_ARRAY   {ADC12_BLADE_AN0, ADC12_BLADE_AN1}
#endif /* MPGL2 */


/*----------------------------------------------------------------------------------------------------------------------
%NRF% Interface Configuration                                                                                                  
------------------------------------------------------------------------------------------------------------------------
Board-specific NRF Interface definitions are kept here
*/
#define NRF_SSP_FLAGS           G_u32Ssp2ApplicationFlags  /*!< Assigns the correct global Application Flags to a self-documenting symbol */

/*! @cond DOXYGEN_EXCLUDE */
#define NRF_MRDY_READ_REG      (AT91C_BASE_PIOB->PIO_PDSR & PB_23_ANT_MRDY) 
#define NRF_MRDY_CLEAR_REG     (AT91C_BASE_PIOB->PIO_CODR = PB_23_ANT_MRDY)     
#define NRF_MRDY_SET_REG       (AT91C_BASE_PIOB->PIO_SODR = PB_23_ANT_MRDY)

#define NRF_SRDY_CLEAR_REG     (AT91C_BASE_PIOB->PIO_CODR = PB_24_ANT_SRDY)            
#define NRF_SRDY_SET_REG       (AT91C_BASE_PIOB->PIO_SODR = PB_24_ANT_SRDY)

#define NRF_RESET_CLEAR_REG    (AT91C_BASE_PIOB->PIO_CODR = PB_21_ANT_RESET)
#define NRF_RESET_SET_REG      (AT91C_BASE_PIOB->PIO_SODR = PB_21_ANT_RESET)

#define NRF_PIOA_PINS          (u32)(PA_25_ANT_USPI2_SCK | PA_23_ANT_USPI2_MOSI | PA_22_ANT_USPI2_MISO)
#define NRF_PIOB_PINS          (u32)(PB_21_ANT_RESET | PB_22_ANT_USPI2_CS | PB_23_ANT_MRDY | PB_24_ANT_SRDY)
/*! @endcond */


/***********************************************************************************************************************
##### Communication peripheral board-specific parameters
***********************************************************************************************************************/
/*! @cond DOXYGEN_EXCLUDE */

/*----------------------------------------------------------------------------------------------------------------------
%UART%  Configuration                                                                                                  
----------------------------------------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------------------------------------
Blade UART Setup

The Blade UART is used for the daughter board interface (serial: 115.2k, 8-N-1) .
*/
/* USART Control Register - Page 734 */
#define BLADE_US_CR_INIT (u32)0x00000050
/*
    31 - 20 [0] Reserved

    19 [0] RTSDIS/RCS no release/force RTS to 1
    18 [0] RTSEN/FCS no drive/force RTS to 0
    17 [0] DTRDIS no drive DTR to 1
    16 [0] DTREN no drive DTR to 0

    15 [0] RETTO no restart timeout
    14 [0] RSTNACK N/A
    13 [0] RSTIT N/A
    12 [0] SENDA N/A

    11 [0] STTTO no start time-out
    10 [0] STPBRK no stop break
    09 [0] STTBRK no transmit break
    08 [0] RSTSTA status bits not reset

    07 [0] TXDIS transmitter not disabled
    06 [1] TXEN transmitter enabled
    05 [0] RXDIS receiver not disabled
    04 [1] RXEN receiver enabled

    03 [0] RSTTX not reset
    02 [0] RSTRX not reset
    01 [0] Reserved
    00 [0] "
*/

/* USART Mode Register - page 737 */
#define BLADE_US_MR_INIT (u32)0x004008C0
/*
    31 [0] ONEBIT start frame delimiter is COMMAND or DATA SYNC
    30 [0] MODSYNC Manchester start bit N/A
    29 [0] MAN Machester encoding disabled
    28 [0] FILTER no filter on Rx line

    27 [0] Reserved
    26 [0] MAX_ITERATION (ISO7816 mode only)
    25 [0] "
    24 [0] "

    23 [0] INVDATA data is not inverted
    22 [1] VAR_SYNC sync field is updated on char to US_THR
    21 [0] DSNACK delicious! NACK is sent on ISO line immeidately on parity error
    20 [0] INACK NACK generated (N/A for async)

    19 [0] OVER 16x oversampling
    18 [0] CLKO USART does not drive the SCK pin
    17 [0] MODE9 CHRL defines char length
    16 [0] MSBF/CPOL LSB first

