eiefirmware/eiefw3/SAM3U2/firmware_common/bsp/configuration.h
    11 [0] "
    10 [0] "
    09 [0] "
    08 [0] "

    07 [0] "
    06 [0] "
    05 [1] "
    04 [1] "

    03 [0] "
    02 [0] "
    01 [0] "
    00 [0] "
*/

/*! @endcond */


/*----------------------------------------------------------------------------------------------------------------------
%I2C%  Configuration                                                                                                  
----------------------------------------------------------------------------------------------------------------------*/
/*! @cond DOXYGEN_EXCLUDE */

/*----------------------------------------------------------------------------------------------------------------------
I²C Master mode for ASCII LCD communication
*/

/*-------------------- TWI0 ---------------------*/
/*Control Register*/
#define TWI0_CR_INIT (u32)0x00000024
/*
    31-8 [0] Reserved

    07 [0] SWRST - Software reset
    06 [0] QUICK - SMBUS Quick Command
    05 [1] SVDIS - Slave mode disable - disabled
    04 [0] SVEN - Slave mode enable

    03 [0] MSDIS - Master mode disable
    02 [1] MSEN - Master mode enable
    01 [0] STOP - Stop a transfer
    00 [0] START - Start a transfer
*/

/*Master Mode Register*/
#define TWI0_MMR_INIT (u32)0x00000000
/*
    31-24 [0] Reserved
    
    23 [0] Reserved
    22 [0] DADR - device slave address - start with zero
    21 [0] "
    20 [0] "

    19 [0] "
    18 [0] "
    17 [0] "
    16 [0] "

    15 [0] Reserved
    14 [0] "
    13 [0] "
    12 [0] MREAD - Master Read Direction - 0 -> Write, 1 -> Read

    11 [0] Reserved
    10 [0] "
    09 [0] IADRSZ - Internal device address - 0 = no internal device address
    08 [0] "

    07-0 [0] Reserved
*/

/* Clock Wave Generator Register */
/* 
    Calculation:
        T_low = ((CLDIV * (2^CKDIV))+4) * T_MCK
        T_high = ((CHDIV * (2^CKDIV))+4) * T_MCK

        T_MCK - period of master clock = 1/(48 MHz)
        T_low/T_high - period of the low and high signals
        
        CKDIV = 2, CHDIV and CLDIV = 59
        T_low/T_high = 2.5 microseconds

        Data frequency - 
        f = ((T_low + T_high)^-1)
        f = 200000 Hz 0r 200 kHz

    Additional Rates:
        50 kHz - 0x00027777
       100 kHz - 0x00023B3B
       200 kHz - 0x00021D1D
       400 kHz - 0x00030707  *Maximum rate*
*/
#define TWI0_CWGR_INIT (u32)0x00021D1D
/*
    31-20 [0] Reserved
    
    19 [0] Reserved
    18 [0] CKDIV
    17 [1] "
    16 [0] "

    15 [0] CHDIV
    14 [0] "
    13 [0] "
    12 [1] "

    11 [1] "
    10 [1] "
    09 [0] "
    08 [1] "

    07 [0] CLDIV - Clock Low Divider
    06 [0] "
    05 [0] "
    04 [1] "

    03 [1] "
    02 [1] "
    01 [0] "
    00 [1] "
*/

/*Interrupt Enable Register*/
#define TWI0_IER_INIT (u32)0x00000142
/*
    31-16 [0] Reserved

    15 [0] TXBUFE - Transmit Buffer Empty
    14 [0] RXBUFF - Receive Buffer Full
    13 [0] ENDTX - End of Transmit Buffer
    12 [0] ENDRX - End of Receive Buffer

    11 [0] EOSACC - End of Slave Address
    10 [0] SCL_WS - Clock Wait State
    09 [0] ARBLST - Arbitration Lost
    08 [1] NACK - Not Acknowledge

    07 [0] Reserved
    06 [1] OVRE - Overrun Error
    05 [0] GACC - General Call Access
    04 [0] SVACC - Slave Access

    03 [0] Reserved
    02 [0] TXRDY - Transmit Holding Register Ready
    01 [1] RXRDY - Receive Holding Register Ready
    00 [0] TXCOMP - Transmission Completed
*/

/*Interrupt Disable Register*/
#define TWI0_IDR_INIT (u32)0x0000FE35
/*
    31-16 [0] Reserved

    15 [1] TXBUFE - Transmit Buffer Empty
    14 [1] RXBUFF - Receive Buffer Full
    13 [1] ENDTX - End of Transmit Buffer
    12 [1] ENDRX - End of Receive Buffer

    11 [1] EOSACC - End of Slave Address
    10 [1] SCL_WS - Clock Wait State
    09 [1] ARBLST - Arbitration Lost
    08 [0] NACK - Not Acknowledge

    07 [0] Reserved
    06 [0] OVRE - Overrun Error
    05 [1] GACC - General Call Access
    04 [1] SVACC - Slave Access

    03 [0] Reserved
    02 [1] TXRDY - Transmit Holding Register Ready
    01 [0] RXRDY - Receive Holding Register Ready
    00 [1] TXCOMP - Transmission Completed
*/

/*! @endcond */



/*--------------------------------------------------------------------------------------------------------------------*/
/* End of File */
/*--------------------------------------------------------------------------------------------------------------------*/

